name: "dali_cassandra_interactive_stress"
backend: "dali"
max_batch_size: 256
input [
  {
    name: "UUID"
    data_type: TYPE_UINT64
    dims: [ 2 ]
  }
]
output [
  {
    name: "DALI_OUTPUT_0"
    data_type: TYPE_UINT8
    dims: [ 1 ]
  }
]

dynamic_batching {
#  max_queue_delay_microseconds: 100
}
